SunCity/src/DataProcessors/СозданиеЧековКоррекции/СозданиеЧековКоррекции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>СозданиеЧековКоррекции</name>
  <attributes>
    <name>АдресЭП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеXMLКорректируемогоЧека</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаКоррекции</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДисконтнаяКарта</name>
    <type>
      <types>CatalogRef.ИнформационныеКарты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.ОснованиеФискальнойОперацииБПО</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументРасчетов</name>
    <type>
      <types>DefinedType.ОснованиеФискальнойОперацииБПО</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйРеквизит</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>КассаККМ</name>
    <type>
      <types>CatalogRef.КассыККМ</types>
    </type>
  </attributes>
  <attributes>
    <name>Кассир</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КассирИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>String</types>
      <types>CatalogRef.ФизическиеЛица</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентИНН</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПредписания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеКоррекции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакАгента</name>
    <type>
      <types>EnumRef.ПризнакиАгента</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМеста</types>
    </type>
  </attributes>
  <attributes>
    <name>СистемаНалогообложения</name>
    <type>
      <types>EnumRef.ТипыСистемНалогообложенияККТ</types>
    </type>
  </attributes>
  <attributes>
    <name>СНОКорректируемогоДокумента</name>
    <type>
      <types>EnumRef.ТипыСистемНалогообложенияККТ</types>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипКоррекции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипРасчета</name>
    <type>
      <types>EnumRef.ТипыРасчетаДенежнымиСредствами</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧекСкорректированный</name>
    <type>
      <types>DocumentRef.ЧекКоррекции</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧекСкорректированныйПроведен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧекСторно</name>
    <type>
      <types>DocumentRef.ЧекКоррекции</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧекСторноПроведен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Оплата</name>
    <attributes>
      <name>ВидОплаты</name>
      <type>
        <types>CatalogRef.ВидыОплатЧекаККМ</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипОплаты</name>
      <type>
        <types>EnumRef.ТипыОплатыККТ</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭквайринговыйТерминал</name>
      <type>
        <types>CatalogRef.ЭквайринговыеТерминалы</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПозицииЧека</name>
    <attributes>
      <name>ГлобальныйИдентификаторТорговойЕдиницы</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДанныеПоставщикаИНН</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДанныеПоставщикаНаименование</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДанныеПоставщикаТелефон</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.БазовыеЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>ИзмененияСостояния</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КодКонтрольнойМарки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтраныПроисхожденияТовара</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КонтрольныйИдентификационныйЗнак</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеПредметаРасчета</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>String</types>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТаможеннойДекларации</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>32</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОператорПереводаАдрес</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ОператорПереводаИНН</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ОператорПереводаНаименование</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ОператорПереводаТелефон</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ОператорПоПриемуПлатежейТелефон</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПлатежныйАгентОперация</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПлатежныйАгентТелефон</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПризнакАгентаПоПредметуРасчета</name>
      <type>
        <types>EnumRef.ПризнакиАгента</types>
      </type>
    </attributes>
    <attributes>
      <name>ПризнакПредметаРасчета</name>
      <type>
        <types>EnumRef.ПризнакиПредметаРасчета</types>
      </type>
    </attributes>
    <attributes>
      <name>ПризнакСпособаРасчета</name>
      <type>
        <types>EnumRef.ПризнакиСпособаРасчета</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаАкциза</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСкидок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСоСкидками</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипМаркировки</name>
      <type>
        <types>EnumRef.ТипыМаркировкиККТ</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаСоСкидками</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

SunCity/src/Enums/ВидыОперацийЧекККМ/ВидыОперацийЧекККМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийЧекККМ</name>
  <comment>(Упр)</comment>
  <enumValues>
    <name>Продажа</name>
  </enumValues>
  <enumValues>
    <name>Возврат</name>
  </enumValues>
</mdclass:Enum>

SunCity/src/Catalogs/КассыККМ/КассыККМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КассыККМ</name>
  <owners>Catalog.Организации</owners>
  <attributes>
    <name>ИспользоватьБезПодключенияОборудования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаРаспределенияВыручкиПоСекциям</name>
    <type>
      <types>CatalogRef.НастройкиРаспределенияВыручкиПоСекциямФР</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодключаемоеОборудование</name>
    <type>
      <types>CatalogRef.ПодключаемоеОборудование</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМеста</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерийныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СоответствиеВидовОплаты</name>
    <type>
      <types>CatalogRef.СоответствиеВидовОплатыСККМOffline</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКассы</name>
    <type>
      <types>EnumRef.ТипыКассККМ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОборудования</name>
    <type>
      <types>EnumRef.ТипыПодключаемогоОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьРучнойРежимФормированияЧека</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьФормироватьНефискальныеЧеки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонЧекаККМ</name>
    <type>
      <types>CatalogRef.ХранилищеШаблонов</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонЧекаККМВозврат</name>
    <type>
      <types>CatalogRef.ХранилищеШаблонов</types>
    </type>
  </attributes>
  <attributes>
    <name>ШиринаЛенты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектронныйЧекEmailПередаютсяПрограммой1С</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектронныйЧекSMSПередаютсяПрограммой1С</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеПечататьБумажныйЧек</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

SunCity/src/DataProcessors/СозданиеЧековКоррекции/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Основание = Неопределено;
	
	Параметры.Свойство("ДокументОснование", Основание);
	Если Основание = Неопределено Тогда
		ТекстСообщения = НСтр("ru = 'Возможен только ввод на основании. Самостоятельное открытие формы не предусмотрено'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ИспользоватьАгентскиеПлатежиИРазделениеВыручки 	= ПолучитьФункциональнуюОпцию("ИспользоватьАгентскиеПлатежиИРазделениеВыручки");
	ИспользоватьКомиссионнуюТорговлю 				= ПолучитьФункциональнуюОпцию("ИспользоватьКомиссионнуюТорговлю");
	ИспользоватьУчетИмпортныхТоваров 				= ПолучитьФункциональнуюОпцию("ИспользоватьУчетИмпортныхТоваров");
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	Объект.РабочееМесто = МенеджерОборудованияВызовСервера.ПолучитьРабочееМестоКлиента();
	ОбработкаОбъект.ЗаполнитьНаОсновании(Основание, Отказ);
	
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
	
	ЗаполнитьВсеСНО();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправлениеВидимостьюИДоступностью();
	ПриИзмененииКассыККМ(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ЗаписьЧекаКоррекции"
		И (Источник = Объект.ЧекСторно
		ИЛИ Источник = Объект.ЧекСкорректированный) Тогда
		
		Статус = НСтр("ru = 'Записан, не пробит'");
		
		Если Параметр.ПробитЧек Тогда
			Статус = НСтр("ru = 'Проведен и пробит'");
		ИначеЕсли Параметр.Проведен Тогда
			Статус = НСтр("ru = 'Проведен, но не пробит'");
		КонецЕсли;
		
		Если Источник = Объект.ЧекСторно Тогда
			ЧекСторноСтатус = Статус;
		Иначе
			ЧекСкорректированныйСтатус = Статус;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура МагазинПриИзменении(Элемент)
	
	Объект.КассаККМ = КассаПоУмолчанию();
	ПриИзмененииКассыККМ(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура КассаККМПриИзменении(Элемент)
	
	ПриИзмененииКассыККМ();
	
КонецПроцедуры

&НаКлиенте
Процедура СистемаНалогообложенияПриИзменении(Элемент)
	
	Если Объект.СНОКорректируемогоДокумента <> Объект.СистемаНалогообложения Тогда
		
		Оповещение = Новый ОписаниеОповещения("НеСоответствиеСНОВопрос", ЭтотОбъект);
		
		ТекстСообщения = НСтр("ru = 'Выбранная система налогообложения не соответствует системе налогообложения ""%1"" корректируемого документа. Продолжить?'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Объект.СНОКорректируемогоДокумента);
		
		ПоказатьВопрос(Оповещение, ТекстСообщения, РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипКоррекцииПриИзменении(Элемент)
	
	УправлениеВидимостьюИДоступностью();
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	Если ТипЗнч(Объект.Контрагент) <> Тип("Строка") И ЗначениеЗаполнено(Объект.Контрагент) Тогда
		Объект.КонтрагентИНН = ОбщегоНазначенияРТВызовСервера.ЗначениеРеквизитаОбъекта(Объект.Контрагент, "ИНН");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийПриИзменении(Элемент)
	
	ПодключитьОбработчикОжидания("Подключаемый_УстановитьКартинкуДляКомментария", 0.1, Истина);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПозицииЧека

&НаКлиенте
Процедура ПозицииЧекаНаименованиеПредметаРасчетаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ПозицииЧека.ТекущиеДанные;
	Если ТекущаяСтрока <> Неопределено 
		И ТипЗнч(ТекущаяСтрока.НаименованиеПредметаРасчета) = Тип("СправочникСсылка.Номенклатура")
		И ЗначениеЗаполнено(ТекущаяСтрока.НаименованиеПредметаРасчета) Тогда
		
		СтруктураРеквизитов = Новый Структура;
		СтруктураРеквизитов.Вставить("ЕдиницаИзмерения");
		СтруктураРеквизитов.Вставить("СтавкаНДС");
		
		РеквизитыНоменклатуры = ОбщегоНазначенияРТВызовСервера.ЗначенияРеквизитовОбъекта(ТекущаяСтрока.НаименованиеПредметаРасчета, СтруктураРеквизитов);
		
		ТекущаяСтрока.ЕдиницаИзмерения 	= РеквизитыНоменклатуры.ЕдиницаИзмерения;
		ТекущаяСтрока.СтавкаНДС 		= РеквизитыНоменклатуры.СтавкаНДС;
		
		ПересчитатьСуммуНДССтроки(ТекущаяСтрока);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПозицииЧекаКоличествоПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ПозицииЧека.ТекущиеДанные;
	Если ТекущаяСтрока <> Неопределено Тогда
		ПересчитатьСуммуСтроки(ТекущаяСтрока);
		ПересчитатьСуммуНДССтроки(ТекущаяСтрока);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПозицииЧекаЦенаСоСкидкамиПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ПозицииЧека.ТекущиеДанные;
	Если ТекущаяСтрока <> Неопределено Тогда
		ПересчитатьСуммуСтроки(ТекущаяСтрока);
		ПересчитатьСуммуНДССтроки(ТекущаяСтрока);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПозицииЧекаСуммаСоСкидкамиПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ПозицииЧека.ТекущиеДанные;
	Если ТекущаяСтрока <> Неопределено Тогда
		ТекущаяСтрока.ЦенаСоСкидками = ?(ТекущаяСтрока.Количество = 0, ТекущаяСтрока.СуммаСоСкидками, ТекущаяСтрока.СуммаСоСкидками / ТекущаяСтрока.Количество);
		ПересчитатьСуммуНДССтроки(ТекущаяСтрока);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПозицииЧекаСтавкаНДСПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ПозицииЧека.ТекущиеДанные;
	Если ТекущаяСтрока <> Неопределено Тогда
		ПересчитатьСуммуНДССтроки(ТекущаяСтрока);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПозицииЧекаСуммаСкидокПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ПозицииЧека.ТекущиеДанные;
	Если ТекущаяСтрока <> Неопределено Тогда
		ТекущаяСтрока.ЦенаСоСкидками = ?(ТекущаяСтрока.Количество = 0, ТекущаяСтрока.СуммаСоСкидками, ТекущаяСтрока.СуммаСоСкидками / ТекущаяСтрока.Количество);
		ПересчитатьСуммуНДССтроки(ТекущаяСтрока);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПозицииЧекаПризнакАгентаПоПредметуРасчетаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ПозицииЧека.ТекущиеДанные;
	
	Если ТекущаяСтрока <> Неопределено И НЕ ЗначениеЗаполнено(ТекущаяСтрока.ПризнакАгентаПоПредметуРасчета) Тогда
		ТекущаяСтрока.ПлатежныйАгентОперация 			= "";
		ТекущаяСтрока.ПлатежныйАгентТелефон 			= "";
		ТекущаяСтрока.ОператорПоПриемуПлатежейТелефон 	= "";
		ТекущаяСтрока.ОператорПереводаНаименование 		= "";
		ТекущаяСтрока.ОператорПереводаИНН 				= "";
		ТекущаяСтрока.ОператорПереводаАдрес 			= "";
		ТекущаяСтрока.ОператорПереводаТелефон 			= "";
		ТекущаяСтрока.ДанныеПоставщикаНаименование 		= "";
		ТекущаяСтрока.ДанныеПоставщикаИНН 				= "";
		ТекущаяСтрока.ДанныеПоставщикаТелефон 			= "";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПозицииЧекаКодСтраныПроисхожденияТовараНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ИдентификаторСтроки = Элементы.ПозицииЧека.ТекущиеДанные.ПолучитьИдентификатор();
	
	ДополнительныеПараметры = Новый Структура("ИдентификаторСтроки", ИдентификаторСтроки);
	ОбработчикОповещения 	= Новый ОписаниеОповещения("ВыборСтраныПроисхождения", ЭтотОбъект, ДополнительныеПараметры);

	ПоказатьВводЗначения(ОбработчикОповещения,,"Выбор страны происхождения товара", Тип("СправочникСсылка.СтраныМира")); 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОплата

&НаКлиенте
Процедура ОплатаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	СуммаПродажи = Объект.ПозицииЧека.Итог("СуммаСоСкидками");
	СуммаОплат   = Объект.Оплата.Итог("Сумма");
	
	ТекущаяСтрока = Элементы.Оплата.ТекущиеДанные;
	Если ТекущаяСтрока <> Неопределено Тогда
		ТекущаяСумма  = ТекущаяСтрока.Сумма;
		ОплатаБезТекущейСтроки = СуммаОплат - ТекущаяСумма;
		ОстатокОплаты = СуммаПродажи - ОплатаБезТекущейСтроки;
	КонецЕсли;
	
	Элементы.ОплатаСумма.СписокВыбора.Очистить();
	
	Если ОстатокОплаты > 0 Тогда
		
		Элементы.ОплатаСумма.СписокВыбора.Добавить(ОстатокОплаты, Формат(ОстатокОплаты, "ЧЦ=15; ЧДЦ=2; ЧРД=,; ЧРГ=' '; ЧН=; ЧГ=3,0"));
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаEmail(Команда)
	
	ДополнительныеПараметры = Новый Структура;
	ОбработчикОповещения = Новый ОписаниеОповещения("ОповещениеОткрытиеФормыВводаEmail", ЭтотОбъект, ДополнительныеПараметры);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Email", Объект.АдресЭП);
	ПараметрыФормы.Вставить("Заголовок", НСтр("ru = 'Введите адрес электронной почты (Email)'"));
	ПараметрыФормы.Вставить("ОтказКлиентаОтСохраненияEmail", ОтказКлиентаОтСохраненияТелефонаEmail);
	
	ПодключаемоеОборудованиеРТКлиент.ОткрытьФормуВводаEmailОтправкиЧерезОФД(ОбработчикОповещения, ПараметрыФормы);

КонецПроцедуры

&НаКлиенте
Процедура КомандаSMS(Команда)
	
	ДополнительныеПараметры = Новый Структура;
	ОбработчикОповещения = Новый ОписаниеОповещения("ОповещениеОткрытиеФормыВводаТелефона", ЭтотОбъект, ДополнительныеПараметры);
	
	Если ЗначениеЗаполнено(Объект.Телефон) Тогда
		Телефон = Число(Объект.Телефон);
	Иначе
		Телефон = 0;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заголовок" , НСтр("ru = 'Введите номер телефона'"));
	ПараметрыФормы.Вставить("ЧислоВвода", Объект.Телефон);
	ПараметрыФормы.Вставить("ОтказКлиентаОтСохраненияТелефона", ОтказКлиентаОтСохраненияТелефонаEmail);
	
	ПодключаемоеОборудованиеРТКлиент.ОткрытьФормуВводаТелефонаДляОтправкиЧерезОФД(ОбработчикОповещения, ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЧеки(Команда)
	
	Результат = СоздатьЧекиСервер();
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		
		Элементы.СтраницаДанныеДляКоррекции.ТолькоПросмотр 	= Истина;
		Элементы.КомандаEmail.Доступность 					= Ложь;
		Элементы.КомандаSMS.Доступность 					= Ложь;
		Модифицированность 									= Ложь;
		
		Если ЗначениеЗаполнено(Результат.ЧекКоррекцииСторно) Тогда
			Объект.ЧекСторно 			= Результат.ЧекКоррекцииСторно;
			Объект.ЧекСторноПроведен 	= Результат.ЧекКоррекцииСторноПроведен;
			
			Если Объект.ЧекСторноПроведен Тогда
				ЧекСторноСтатус = 1;
			Иначе
				ЧекСторноСтатус = 3;
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Результат.ЧекСкорректированный) Тогда
			Объект.ЧекСкорректированный			= Результат.ЧекСкорректированный;
			Объект.ЧекСкорректированныйПроведен = Результат.ЧекСкорректированныйПроведен;
			
			Если Объект.ЧекСкорректированныйПроведен Тогда
				ЧекСкорректированныйСтатус = 1;
			Иначе
				ЧекСкорректированныйСтатус = 3;
			КонецЕсли;

		КонецЕсли;
		
		// Пробиваем по принципу: сначала приход денег в кассу, потом расход
		Если Объект.ЧекСторноПроведен И Объект.ЧекСкорректированныйПроведен Тогда
			
			Если Объект.ТипРасчета = ПредопределенноеЗначение("Перечисление.ТипыРасчетаДенежнымиСредствами.ПриходДенежныхСредств")
				ИЛИ Объект.ТипРасчета = ПредопределенноеЗначение("Перечисление.ТипыРасчетаДенежнымиСредствами.ВозвратРасходаДенежныхСредств") Тогда
				
				Если Объект.ТипКоррекции = 2 Тогда
					ПробиватьСледующийЧек = Ложь;
				Иначе
					ПробиватьСледующийЧек = Истина;
				КонецЕсли;
				ПробитьЧекВыполнить(Объект.ЧекСкорректированный, ПробиватьСледующийЧек);
				
			Иначе
				
				ПробитьЧекВыполнить(Объект.ЧекСторно);
				
			КонецЕсли;
			
		ИначеЕсли Объект.ТипКоррекции = 2 И Объект.ЧекСкорректированныйПроведен Тогда
			
			ПробитьЧекВыполнить(Объект.ЧекСкорректированный, Ложь);
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Результат.ЧекКоррекцииСторно) ИЛИ ЗначениеЗаполнено(Результат.ЧекСкорректированный) Тогда
			ОповеститьОбИзменении(Тип("ДокументСсылка.ЧекКоррекции"));
		КонецЕсли;
		
		ЭтотОбъект.ТекущийЭлемент = Элементы.СтраницаСозданныеДокументы;
		
	КонецЕсли;
	
	УправлениеВидимостьюИДоступностью()
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументНаОснованииСторно(Команда)
	
	ДокументОснование = Объект.ЧекСторно;
	ЭтоСторно = Истина;
	СоздатьУчетныйДокументНаОснованииКоррекции(ДокументОснование, ЭтоСторно);
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументНаОснованииКоррекции(Команда)
	
	ДокументОснование = Объект.ЧекСкорректированный;
	СоздатьУчетныйДокументНаОснованииКоррекции(ДокументОснование);
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументФинансовыйНаОснованииСторно(Команда)
	
	ДокументОснование = Объект.ЧекСторно;
	ЭтоСторно = Истина;
	СоздатьФинансовыйДокументНаОснованииКоррекции(ДокументОснование, ЭтоСторно);
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументФинансовыйНаОснованииКоррекции(Команда)
	
	ДокументОснование = Объект.ЧекСкорректированный;
	СоздатьФинансовыйДокументНаОснованииКоррекции(ДокументОснование);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОповещениеОткрытиеФормыВводаEmail(РезультатОткрытияФормы, ДополнительныеПараметры) Экспорт
	
	Если НЕ РезультатОткрытияФормы = Неопределено Тогда
		
		Если ЗначениеЗаполнено(РезультатОткрытияФормы.Email) Тогда
			Объект.АдресЭП = РезультатОткрытияФормы.Email;
			Объект.Телефон = "";
		Иначе
			Объект.АдресЭП = "";
			Объект.Телефон = "";
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеОткрытиеФормыВводаТелефона(РезультатОткрытияФормы, ДополнительныеПараметры) Экспорт
	
	Если НЕ РезультатОткрытияФормы = Неопределено Тогда
		
		Если ЗначениеЗаполнено(РезультатОткрытияФормы.ВведенноеЧисло) Тогда
			Объект.Телефон = Формат(РезультатОткрытияФормы.ВведенноеЧисло, "ЧЦ=10; ЧДЦ=; ЧГ=0");
			Объект.АдресЭП = "";
		Иначе
			Объект.Телефон = "";
			Объект.АдресЭП = "";
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборСтраныПроисхождения (РезультатВыполнения, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыполнения <> Неопределено Тогда
		
		ТекущаяСтрока = Объект.ПозицииЧека.НайтиПоИдентификатору(ДополнительныеПараметры.ИдентификаторСтроки);
		
		Если ТекущаяСтрока <> Неопределено Тогда
			
			ТекущаяСтрока.КодСтраныПроисхожденияТовара = ОбщегоНазначенияРТВызовСервера.ЗначениеРеквизитаОбъекта(РезультатВыполнения, "Код");
			Элементы.ПозицииЧека.ЗакончитьРедактированиеСтроки(Ложь);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПробитьЧекВыполнитьЗавершение(РезультатВыполнения, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыполнения.Результат Тогда
		
		ЗаписатьЧекКоррекцииПослеПробития(РезультатВыполнения.ПараметрыФискализации);
		
		// Если чек сторно пробился, то пробивается скорректированный чек
		ПробитыйДокумент = РезультатВыполнения.ПараметрыФискализации.ДокументОснование;
		
		Если ПробитыйДокумент = Объект.ЧекСторно  Тогда
			
			Если ДополнительныеПараметры.ПробиватьСледующийЧек Тогда
			
				ПробитьЧекВыполнить(Объект.ЧекСкорректированный, Ложь);
			
			КонецЕсли;
			
		ИначеЕсли ПробитыйДокумент = Объект.ЧекСкорректированный Тогда
			
			Если ДополнительныеПараметры.ПробиватьСледующийЧек Тогда
			
				ПробитьЧекВыполнить(Объект.ЧекСторно, Ложь);
			
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		ТекстСообщения = НСтр("ru = 'При печати чека произошла ошибка:'");
		ТекстСообщения = ТекстСообщения + Символы.ПС + РезультатВыполнения.ОписаниеОшибки;
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьДанныеККМЗавершение(РезультатВыполнения, ДополнительныеПараметры) Экспорт
	
	ПоддерживаемыеСНОКассойККМ.Очистить();
	
	Если РезультатВыполнения.Результат Тогда
		
		СтрокаСНО 		= РезультатВыполнения.ПараметрыККТ.КодыСистемыНалогообложения;
		МассивКодовСНО 	= СтрРазделить(СтрокаСНО, ",");
		
		Для Каждого КодСНО Из МассивКодовСНО Цикл
			
			Попытка
				КодСНОЧисло = Число(КодСНО);
				ПоддерживаемыеСНОКассойККМ.Добавить(МенеджерОборудованияКлиентСервер.СистемаНалогообложенияККТПоКоду(КодСНОЧисло));
			Исключение
				ТекстСообщения = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
				ПоказатьПредупреждение(,НСтр("ru = 'Операция не может быть выполнена по причине:'") + Символы.ПС + ТекстСообщения);
			КонецПопытки;
		
		КонецЦикла;
		
		Если ДополнительныеПараметры.ВыполнитьПроверку Тогда
		
			ПроверитьКассуККМ(ДополнительныеПараметры.ВыводитьПредупреждение);
		
		КонецЕсли;
		
	Иначе
		
		ТекстСообщения = НСтр("ru = 'Не удалось получить список систем налогообложения поддерживаемых кассой ККМ:'");
		ТекстСообщения = ТекстСообщения + Символы.ПС + РезультатВыполнения.ОписаниеОшибки;
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,);
		
		Объект.СистемаНалогообложения = ПредопределенноеЗначение("Перечисление.ТипыСистемНалогообложенияККТ.ПустаяСсылка");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НеСоответствиеСНОВопрос(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Объект.СистемаНалогообложения = ПредопределенноеЗначение("Перечисление.ТипыСистемНалогообложенияККТ.ПустаяСсылка");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НеПоддерживаемаяСНОВопрос(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Объект.КассаККМ = ПредопределенноеЗначение("Справочник.КассыККМ.ПустаяСсылка");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСуммуСтроки(ТекущаяСтрока)
	
	ТекущаяСтрока.СуммаСоСкидками = ТекущаяСтрока.Количество * ТекущаяСтрока.ЦенаСоСкидками;
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСуммуНДССтроки(ТекущаяСтрока)
	
	ТекПроцентНДС = ОбработкаТабличнойЧастиТоварыКлиентПовтИсп.СтавкаНДСЧислом(ТекущаяСтрока.СтавкаНДС);
	ТекущаяСтрока.СуммаНДС = ТекущаяСтрока.СуммаСоСкидками * ТекПроцентНДС / (ТекПроцентНДС + 1);
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеВидимостьюИДоступностью()
	
	Если Объект.ТипКоррекции = 1 Тогда
		Элементы.НомерПредписания.Видимость = Истина;
	ИначеЕсли Объект.ТипКоррекции = 2 Тогда
		Элементы.НомерПредписания.Видимость = Ложь;
		Объект.ОписаниеКоррекции = Нстр("ru = 'Корректировка тега 2108'");
	Иначе
		Элементы.НомерПредписания.Видимость = Ложь;
	КонецЕсли;
	
	Если Объект.ЧекСкорректированныйПроведен И Объект.ЧекСторноПроведен Тогда
		Элементы.ГруппаСкорректированнаяОбщая.Видимость = Истина;
		Элементы.ГруппаСторноОбщая.Видимость = Истина;
	ИначеЕсли Объект.ТипКоррекции = 2 И Объект.ЧекСкорректированныйПроведен Тогда
		Элементы.ГруппаСкорректированнаяОбщая.Видимость = Истина;
		Элементы.ГруппаСторноОбщая.Видимость = Ложь;
	Иначе
		Элементы.ГруппаСкорректированнаяОбщая.Видимость = Ложь;
		Элементы.ГруппаСторноОбщая.Видимость = Ложь;
	КонецЕсли;
	
	Если Объект.ТипРасчета = ПредопределенноеЗначение("Перечисление.ТипыРасчетаДенежнымиСредствами.ПриходДенежныхСредств")
		ИЛИ Объект.ТипРасчета = ПредопределенноеЗначение("Перечисление.ТипыРасчетаДенежнымиСредствами.ВозвратРасходаДенежныхСредств") Тогда
		Элементы.ДокументНаОснованииСторно.Заголовок = "Оприходовать";
		Элементы.ДокументНаОснованииКоррекции.Заголовок = "Списать";
		Элементы.ДокументФинансовыйНаОснованииКоррекции.Заголовок = "Приходный ордер";
		Элементы.ДокументФинансовыйНаОснованииСторно.Заголовок = "Расходный ордер";
	Иначе
		Элементы.ДокументНаОснованииСторно.Заголовок = "Списать";
		Элементы.ДокументНаОснованииКоррекции.Заголовок = "Оприходовать";
		Элементы.ДокументФинансовыйНаОснованииСторно.Заголовок = "Приходный ордер";
		Элементы.ДокументФинансовыйНаОснованииКоррекции.Заголовок = "Расходный ордер";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УстановитьКартинкуДляКомментария()
	
	ОбщегоНазначенияРТКлиентСервер.УстановитьКартинкуДляКомментария(Элементы.СтраницаКомментарий, Объект.Комментарий);
	
КонецПроцедуры

&НаСервере
Функция СоздатьЧекиСервер()
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат Ложь;
	Иначе
		Возврат Обработки.СозданиеЧековКоррекции.СоздатьЧекиКоррекции(Объект);
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ПробитьЧекВыполнить(ЧекКоррекции, ПробиватьСледующийЧек = Истина)
	
	ИдентификаторУстройства = Неопределено;
	ОбщиеПараметры = ПодготовитьДанныеДляПробитияЧека(ЧекКоррекции, ИдентификаторУстройства);
	
	Если ТипЗнч(ОбщиеПараметры) = Тип("Структура") Тогда
		
		ПараметрыОповещения = Новый Структура("ПробиватьСледующийЧек", ПробиватьСледующийЧек);
		Оповещение = Новый ОписаниеОповещения("ПробитьЧекВыполнитьЗавершение", ЭтотОбъект, ПараметрыОповещения);
		МенеджерОборудованияКлиент.НачатьФискализациюЧекаНаФискальномУстройстве(Оповещение, ЭтотОбъект.УникальныйИдентификатор, ОбщиеПараметры, ИдентификаторУстройства);
		
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПодготовитьДанныеДляПробитияЧека(ЧекКоррекции, ИдентификаторУстройства)
	
	Возврат Документы.ЧекКоррекции.ПодготовитьДанныеДляПробитияЧека(ЧекКоррекции, ИдентификаторУстройства);
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗаписатьЧекКоррекцииПослеПробития(ВыходныеПараметры)
	
	ЧекКоррекцииОбъект = ВыходныеПараметры.ДокументОснование.ПолучитьОбъект();
	
	ЧекКоррекцииОбъект.НомерСмены = ВыходныеПараметры.НомерСменыККТ;
	
	Если ЗначениеЗаполнено(ВыходныеПараметры.НомерЧекаККТ) Тогда
		ЧекКоррекцииОбъект.НомерЧека = ВыходныеПараметры.НомерЧекаККТ;
	КонецЕсли;
	
	ЧекКоррекцииОбъект.ПробитЧек = Истина;
	
	ЧекКоррекцииОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииКассыККМ(ВыводитьПредупреждение = Истина)
	
	Если ЗначениеЗаполнено(Объект.КассаККМ) Тогда
		
		ЗаполнитьПоддерживаемыеСНО(ВыводитьПредупреждение, Истина);
		
	Иначе
		
		ПоддерживаемыеСНОКассойККМ = ВсеСНО.Скопировать();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоддерживаемыеСНО(ВыводитьПредупреждение, ВыполнитьПроверку)
	
	ПараметрыКассыККМ		= ЗначениеНастроекВызовСервера.ПараметрыКассыККМ(Объект.КассаККМ);
	ИдентификаторУстройства = ПараметрыКассыККМ.ИдентификаторУстройства;
	
	ПараметрыОперации = МенеджерОборудованияКлиентСервер.ПараметрыВыполненияОперации();
	
	ПараметрыОповещения = Новый Структура();
	ПараметрыОповещения.Вставить("ВыводитьПредупреждение", 	ВыводитьПредупреждение);
	ПараметрыОповещения.Вставить("ВыполнитьПроверку", 		ВыполнитьПроверку);
	
	Оповещение = Новый ОписаниеОповещения("ПолучитьДанныеККМЗавершение", ЭтотОбъект, ПараметрыОповещения);
	
	МенеджерОборудованияКлиент.НачатьПолучениеПараметровФискальногоУстройства(Оповещение, 
																				УникальныйИдентификатор, 
																				ИдентификаторУстройства,
																				ПараметрыОперации);
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьКассуККМ(ВыводитьПредупреждение)
	
	Если ПоддерживаемыеСНОКассойККМ.НайтиПоЗначению(Объект.СНОКорректируемогоДокумента) = Неопределено Тогда
		
		Если ВыводитьПредупреждение Тогда
			
			ТекстСообщения = НСтр("ru = 'Выбранная касса ККМ не поддерживает систему налогообложения ""%1"" корректируемого документа. Выберите другую кассу ККМ.'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Объект.СНОКорректируемогоДокумента);
			
			ПоказатьПредупреждение(, ТекстСообщения);
			
		КонецЕсли;
		
		Объект.КассаККМ = ПредопределенноеЗначение("Справочник.КассыККМ.ПустаяСсылка");
		
		ПриИзмененииКассыККМ();
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.СистемаНалогообложения)
		И Объект.СистемаНалогообложения <> Объект.СНОКорректируемогоДокумента
		И ПоддерживаемыеСНОКассойККМ.НайтиПоЗначению(Объект.СистемаНалогообложения) = Неопределено Тогда
		
		ТекстСообщения = НСтр("ru = 'Выбранная касса ККМ не поддерживает систему налогообложения ""%1"". Значение очищено.'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Объект.СистемаНалогообложения);
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "Объект.СистемаНалогообложения");
		
		Объект.СистемаНалогообложения = ПредопределенноеЗначение("Перечисление.ТипыСистемНалогообложенияККТ.ПустаяСсылка");
		
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьВсеСНО()
	
	ВсеСНО.Очистить();
	
	Для каждого ЭлементМетаданных Из Метаданные.Перечисления.ТипыСистемНалогообложенияККТ.ЗначенияПеречисления Цикл
		ВсеСНО.Добавить(Перечисления.ТипыСистемНалогообложенияККТ[ЭлементМетаданных.Имя])
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция КассаПоУмолчанию()
	
	Возврат Справочники.КассыККМ.КассаПоУмолчанию(Объект.Организация, Объект.Магазин);
	
КонецФункции

&НаКлиенте
Процедура СистемаНалогообложенияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = ПоддерживаемыеСНОКассойККМ;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьУчетныйДокументНаОснованииКоррекции(ДокументОснование, ЭтоСторно = Ложь)
	
	РеквизитыОснования = ДанныеДокументаОснования(ДокументОснование);
	
	ЗначенияЗаполнения = ДокументОснование;
	
	Если РеквизитыОснования.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийЧекККМ.Возврат") И ЭтоСторно Тогда
		Форма = "Документ.ОприходованиеТоваров.Форма.ФормаДокумента";
	ИначеЕсли РеквизитыОснования.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийЧекККМ.Возврат") И Не ЭтоСторно Тогда
		Форма = "Документ.ОприходованиеТоваров.Форма.ФормаДокумента";
	Иначе
		Форма = "Документ.СписаниеТоваров.Форма.ФормаДокумента";
	КонецЕсли;
	
	ОткрытьФорму(Форма,
		Новый Структура("Основание", ЗначенияЗаполнения),
		,
		КлючУникальности,
		,
		);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьФинансовыйДокументНаОснованииКоррекции(ДокументОснование, ЭтоСторно = Ложь)
	
	РеквизитыОснования = ДанныеДокументаОснования(ДокументОснование);
	
	ЗначенияЗаполнения = ДокументОснование;
	
	Если РеквизитыОснования.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийЧекККМ.Возврат") И ЭтоСторно Тогда
		Форма = "Документ.РасходныйКассовыйОрдер.Форма.ФормаДокумента";
	ИначеЕсли РеквизитыОснования.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийЧекККМ.Возврат") И Не ЭтоСторно Тогда
		Форма = "Документ.РасходныйКассовыйОрдер.Форма.ФормаДокумента";
	Иначе
		Форма = "Документ.ПриходныйКассовыйОрдер.Форма.ФормаДокумента";
	КонецЕсли;
	
	ОткрытьФорму(Форма,
		Новый Структура("Основание", ЗначенияЗаполнения),
		,
		КлючУникальности,
		,
		);
	
КонецПроцедуры

&НаСервере
Функция ДанныеДокументаОснования(Основание)
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Основание, "ВидОперации");
КонецФункции

#КонецОбласти
